## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_monitor_data_collection_rule_association.aks_amwdcra["blue"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_amwdcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "MSProm-northeurope-prvaks"
      + target_resource_id      = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
    }

  # azurerm_monitor_data_collection_rule_association.aks_cidcra["blue"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "aks_cidcra" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = "MSCi-northeurope-prvaks"
      + target_resource_id      = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
    }

  # module.aks-monitoring.azurerm_dashboard_grafana.aks_grafana will be created
  + resource "azurerm_dashboard_grafana" "aks_grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "northeurope"
      + name                                   = "prvaks-grafana"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "aztf-spoke-rg"
      + sku                                    = "Standard"
      + tags                                   = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_endpoint.aks_dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "aks_dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "northeurope"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "prvaks-dce"
      + public_network_access_enabled = true
      + resource_group_name           = "aztf-spoke-rg"
      + tags                          = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_rule.aks_cidcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_cidcr" {
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "northeurope"
      + name                = "MSCI-northeurope-prvaks"
      + resource_group_name = "aztf-spoke-rg"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + data_flow {
          + destinations = [
              + "ciworkspace",
            ]
          + streams      = [
              + "Microsoft-ContainerLog",
              + "Microsoft-ContainerLogV2",
              + "Microsoft-KubeEvents",
              + "Microsoft-KubePodInventory",
              + "Microsoft-KubeNodeInventory",
              + "Microsoft-KubePVInventory",
              + "Microsoft-KubeServices",
              + "Microsoft-KubeMonAgentEvents",
              + "Microsoft-InsightsMetrics",
              + "Microsoft-ContainerInventory",
              + "Microsoft-ContainerNodeInventory",
              + "Microsoft-Perf",
            ]
        }
      + data_flow {
          + destinations = [
              + "ciworkspace",
            ]
          + streams      = [
              + "Microsoft-Syslog",
            ]
        }

      + data_sources {
          + extension {
              + extension_json = jsonencode(
                    {
                      + dataCollectionSettings = {
                          + enableContainerLogV2   = true
                          + interval               = "1m"
                          + namespaceFilteringMode = "Off"
                          + namespaces             = [
                              + "kube-system",
                              + "gatekeeper-system",
                              + "azure-arc",
                            ]
                        }
                    }
                )
              + extension_name = "ContainerInsights"
              + name           = "ContainerInsightsExtension"
              + streams        = [
                  + "Microsoft-ContainerLog",
                  + "Microsoft-ContainerLogV2",
                  + "Microsoft-KubeEvents",
                  + "Microsoft-KubePodInventory",
                  + "Microsoft-KubeNodeInventory",
                  + "Microsoft-KubePVInventory",
                  + "Microsoft-KubeServices",
                  + "Microsoft-KubeMonAgentEvents",
                  + "Microsoft-InsightsMetrics",
                  + "Microsoft-ContainerInventory",
                  + "Microsoft-ContainerNodeInventory",
                  + "Microsoft-Perf",
                ]
            }
          + syslog {
              + facility_names = [
                  + "auth",
                  + "authpriv",
                  + "cron",
                  + "daemon",
                  + "mark",
                  + "kern",
                  + "local0",
                  + "local1",
                  + "local2",
                  + "local3",
                  + "local4",
                  + "local5",
                  + "local6",
                  + "local7",
                  + "lpr",
                  + "mail",
                  + "news",
                  + "syslog",
                  + "user",
                  + "uucp",
                ]
              + log_levels     = [
                  + "Debug",
                  + "Info",
                  + "Notice",
                  + "Warning",
                  + "Error",
                  + "Critical",
                  + "Alert",
                  + "Emergency",
                ]
              + name           = "sysLogsDataSource"
              + streams        = [
                  + "Microsoft-Syslog",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "ciworkspace"
              + workspace_resource_id = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.OperationalInsights/workspaces/prvaks-laws"
            }
        }
    }

  # module.aks-monitoring.azurerm_monitor_data_collection_rule.aks_promdcr will be created
  + resource "azurerm_monitor_data_collection_rule" "aks_promdcr" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "northeurope"
      + name                        = "MSProm-northeurope-prvaks"
      + resource_group_name         = "aztf-spoke-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }

      + data_flow {
          + destinations = [
              + "MonitoringAccount1",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "MonitoringAccount1"
            }
        }
    }

  # module.aks-monitoring.azurerm_monitor_workspace.aks_amw will be created
  + resource "azurerm_monitor_workspace" "aks_amw" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "prvaks-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "aztf-spoke-rg"
      + tags                                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_resource_group.monitoring_rg will be created
  + resource "azurerm_resource_group" "monitoring_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-spoke-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_data_reader will be created
  + resource "azurerm_role_assignment" "role_monitoring_data_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_reader will be created
  + resource "azurerm_role_assignment" "role_monitoring_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-grafana_admin.azurerm_role_assignment.eid_group_assignment["5834d83c-4d84-4438-8f5d-581fc9f12fa9"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5834d83c-4d84-4438-8f5d-581fc9f12fa9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.eid_role_assignment-grafana_viewer.azurerm_role_assignment.eid_group_assignment["cc947677-763d-448e-91f4-878d797588e6"] will be created
  + resource "azurerm_role_assignment" "eid_group_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cc947677-763d-448e-91f4-878d797588e6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```
</details>